# -*- coding: utf-8 -*-
"""
Created on Thu Sep  8 14:23:24 2022

@author: sidorow
"""

# 1. СПИСКИ в Python
#
#
#%%
# Список в Python проще всего предствивить ввиде одномерного масива чисел. 
# Создается список с помощью квадратных скобок, каждая ячейка массива отделяется 
# от другой с помощью запятой
ListNumbers=[1, 4, 6, 3.14, 5e+07]
# При этом список может содержать разные перемерные, как числа, так и текст:
ListNumbersText=[1, 4, 6, 3.14, 5e+07, 'Metal forming', 'Heat Treatment']
#%%
# Существует множество команд для редактирвоания списков. Список команд вы можете
# уведеть, если наберете название списка (ListNumbers в нашем случае), посвавите
# точку и нажмене на клавиатуре Tab. В частвности, есть команда append, позволяющая 
# что-то добавить в конец списка:
ListNumbers.append(100)
# или команда pop, позволяющая, наоборот удалить либо последнюю строку:
ListNumbersText.pop()
# либо определенный элемент (об индексации элементов списка чуть позже)
ListNumbersText.pop(3)
# Можем полность почистить содержимое списка:
ListNumbersText = []
# Можем узнать количество элементов в списке
Length = len(ListNumbers)
# и т.д.
#%% 
# Допустим нам нужно умножить все числа из списка ListNumbers на 2. Если мы
# просто умножим попробуем записать ListNumbers = ListNumbers*2, то ничего не
# получится, у нас просто все числа из списка скопируются в его конец и список 
# станет в два раза длиннее:
ListNumbersDoubled=ListNumbers*2
# Для решения подобных задач, нам необходимо понять, как списки в Python индексируются...
# Переменные из списка пронумерованы от 0 до n-1, где n - длина списка. Вызвать 
# тот или иной элеменнт из списка мы можем поместив индекс в квадратные скобки
# после имени списка. Например:
ZeroElement=ListNumbers[0]
ThirdElement=ListNumbers[2]
    
# for item in range(Length):
#     ListNumbers[item] = ListNumbers[item]*2