# -*- coding: utf-8 -*-
"""
Created on Thu Sep  8 14:23:24 2022

@author: sidorow
"""

# 1. СПИСКИ в Python
# 2. СЛОВАРИ в Python
# 
#
#
#%%    СПИСКИ в Python
'''
Список в Python проще всего предствивить ввиде одномерного масива чисел. 
Создается список с помощью квадратных скобок, каждая ячейка массива 
отделяется от другой с помощью запятой
'''

ListNumbers=[1, 4, 6, 3.14, 5e+07]
# При этом список может содержать разные перемерные, как числа, так и текст:
ListNumbersText=[1, 4, 6, 3.14, 5e+07, 'Metal forming', 'Heat Treatment']
#%%
'''
Существует множество команд для редактирвоания списков. 
Список команд вы можете уведеть, если наберете название списка 
(ListNumbers в нашем случае), посвавите точку и нажмене на 
клавиатуре Tab. В частвности, есть команда append, позволяющая 
что-то добавить в конец списка:
'''
ListNumbers.append(100)
# Этот список может быть отсортирован:
ListNumbers.sort()
# А может быть "переворнут":
ListNumbers.reverse()
# или команда pop, позволяющая, наоборот удалить либо последнюю строку:
ListNumbersText.pop()
# либо определенный элемент (об индексации элементов списка чуть позже)
ListNumbersText.pop(3)
# Этот список может быть отсортирован:
ListNumbers.sort()
# А может быть "переворнут":
ListNumbers.reverse()
# Можем вставить объект в необходимое нам место:
ListNumbers.insert(3, 4.45) 
# Можем объединить два списка:
ThirdList=ListNumbers+ListNumbersText
# Можем добавить данные из второго списка в первый:
ListNumbersText.extend(ListNumbers)
# Можем создать копию списка:
CopyListNumbers = ListNumbers.copy()
# Можем найти индекс интересующего нас числе
index = ListNumbers.index(6)
# можем посчитать сколько раз встречается то или иное число в списке
count1 = ThirdList.count(1.0)
'''
Важно понимать, что если мы просто присвоим переменной 
CopyListNumbers = ListNumbers, то мы создадим зависимую копию,
которая будет изменяться вместе со своим оригиналом.  
Можем полность почистить содержимое списка:
'''
ListNumbersText = []
# Можем узнать количество элементов в списке
Length = len(ListNumbers)
# Можем узнать сколько значений определенной виличины есть в списке
ListNumbersText.count(50000000)
# и т.д.
#%% 
'''
Допустим нам нужно умножить все числа из списка ListNumbers на 2. 
Если мы просто умножим попробуем записать 
ListNumbers = ListNumbers*2, то ничего не получится, у нас просто 
все числа из списка скопируются в его конец и список 
станет в два раза длиннее:

'''

ListNumbersDoubled=ListNumbers*2
'''
Для решения подобных задач, нам необходимо понять, 
как списки в Python индексируются...
Переменные из списка пронумерованы от 0 до n-1, где n - длина списка. 
Вызвать тот или иной элеменнт из списка мы можем поместив индекс 
в квадратные скобки после имени списка. Например:
'''
ZeroElement=ListNumbers[0]
ThirdElement=ListNumbers[2]
# При этом, если нас интересует последний номер из списка, а длину списка мы 
# по каким-то причинам не знаем, то мы можем вызвать его как элемент номер -1, т.е.:
LastElement=ListNumbers[-1]
# Мы можем сделать срез из списка, т.е. скопировать в другой список элементы, 
# например со 1-го по 3-й:
Slice01=ListNumbers[1:4]
# обратите, внимание, что если нам нужно задать диапазон индексов от n до m, то
# мы задаем диапазон от n до !!!!! m+1 !!!!!
# Можно сдедать срез от, например, второго до последнего элемента:
Slice02=ListNumbers[2:-1]
# и добавить последний элемент:
Slice02.append(ListNumbers[-1])
# Если нам нужно выбрать элементы через 1, то можно это сделать следующим образом:
Slice03=ListNumbers[0:-1:2]
# т.е. задается диапазон и шаг с которым нужно копировать чилса из списка
#%%
# Возвращаясь к исходной задаче, а именно умножить все числа из списка ListNumbers на 2:
for i in range(Length):
   ListNumbers[i] = ListNumbers[i]*2
# Т.е. у нас есть размер списка, мы его ранее определили и он равен переменной
# Length. С помощью оператора for мы запускаем итерационный цикл, в котором
# последовательно каждое число из списка умножается на 2
#%%
# Давайте скопируем список ListNumbers двумя способами: в список Copy01ListNumbers
# просто с помощью знака = и в список Copy02ListNumbers с помощью команды list
Copy01ListNumbers=ListNumbers
Copy02ListNumbers=list(ListNumbers)
# После этого давайте прибавим к каждому числу в списке ListNumbers единицу
for i in range(Length):
   ListNumbers[i] = ListNumbers[i]+1
   ListSumm=list()
for i in range(Length):
    ListSumm.append(Copy01ListNumbers[i]+Copy02ListNumbers[i])
"""
Обратите внимание, что вместе со списком ListNumbers изменился список 
Copy01ListNumbers. Это характерная особенность сложных объектов Python (списки, 
словари, массивы и т.д.):
знаком = мы не создаем независимую переменную, а лишь дочернюю переменную 
жестко связанную с материнской. Если нам нужно отвязать дочерний список от
материнского, неоьходимо использовать команду list()
Если нам нужно почленно сложить два списка, то мы действуем аналогично, как при
умножении на 2, но для начала можем создать пустой список, в который
потом будем итерационно добавлять команой append результат почленного сложения:
"""
#%%
"""
Задача #10. 
Сумма простых чисел меньше 10: 2 + 3 + 5 +7 = 17.
Сохраните все простые числа в список и найдите их сумму.
"""

print ('----Task #2-------')
maximum_integer = 100 # максимальное натуральное числе
print ('Простые числа меньше ' + str(maximum_integer) + ':')

i=1 # переменная, которая в цикле будем меняться от 1 до 1000 с шагом 1

primes = [] # список, куда мы будем собирать все простые числа


while i<maximum_integer: # цикл продолжается до тех пор, пока i меньше 1000
    i+=1 # шаг изменения переменной i
    count=1 # мнимая переменная. если = 1, значит числь простое, если нет, то
        # имеет делители отличные от 1 и самой себя
    for j in range(2,i): # цикл от 2 до числа i с шагом 1
        if i%j==0: # проверяем делится ли число i  на число j
            count=0 # если хоть один раз, услвовие i%j==0, значит число i
                    # не является простым и переменную count мы обнуляем и
                    # далее число i не будет добавлятся к переменной sum_
            break
    
    if count==1: # переменная count==1 если условие i%j==0 ни разу не было выполнено
                    # т.е. число i - простое
        primes.append(i)
                
sum_=sum(primes)
        
print(' ')
print('Сумма этих чисел = '  + str(sum_))
print('-----------------')

#%%
'''
СЛОВАРИ В Python.
Словарь в Python записывается в фигурных скобках { }, имеет кличи (keys)
и значения (values) и не упорядочивается.
Ключ должен быть неизменным, а значения могут быть любыми: float, 
integer или string.    
Пример словаря, хим. сомтав стали:
'''
composition={'GrainSize': 7.0, 'C': 0.8, 'Mn': 0.7, 'Si': 1.9, 'Ni': 0.2, 
              'Cr': 0.3, 'Mo': 0.0, 'W': 0.0, 'As': 0.0, 'V': 0, 'Cu': 0.03}

# Вызвать значение того или иного ключа из словаря мы можем командрой get():
C = composition.get('C')
# либо
Mn = composition['Mn']

# Поменять значение:
composition['Si'] = 1.5

# записать все ключи в список:
keys = list(composition.keys())
# записать все значения в список:
values = list(composition.values())

# создать словарь из двух списков:
   
composition_copy = dict(zip(keys, values))
# обращаем внимание, что функция zip позволяет проитерировать несколько
# объектов одновременно

# можно добавить в словарь новую пару
composition_copy['Al'] = 0.1

# можно что-то удалить:
composition_copy.pop('As')
#%%
# можем проитерировать словарь
for item in composition.keys():
    composition[item] = composition[item] +0.1
    
    




















