# -*- coding: utf-8 -*-
"""
Created on Thu Sep  8 14:23:24 2022

@author: sidorow
"""

# 1. СПИСКИ в Python
#
# 
#
#
#%%    СПИСКИ в Python
'''
Список в Python проще всего предствивить ввиде одномерного масива чисел. 
Создается список с помощью квадратных скобок, каждая ячейка массива 
отделяется от другой с помощью запятой
'''

ListNumbers=[1, 4, 6, 3.14, 5e+07]
# При этом список может содержать разные перемерные, как числа, так и текст:
ListNumbersText=[1, 4, 6, 3.14, 5e+07, 'ABC', 'x']
#%%
'''
Существует множество команд для редактирвоания списков. 
Список команд вы можете уведеть, если наберете название списка 
(ListNumbers в нашем случае), посвавите точку и нажмене на 
клавиатуре Tab. В частвности, есть команда append, позволяющая 
что-то добавить в конец списка:
'''
ListNumbers.append(100)
# Этот список может быть отсортирован:
ListNumbers.sort()
# А может быть "переворнут":
ListNumbers.reverse()
# или команда pop, позволяющая, наоборот удалить либо последнюю строку:
ListNumbersText.pop()
# либо определенный элемент (об индексации элементов списка чуть позже)
ListNumbersText.pop(3)
# Этот список может быть отсортирован:
ListNumbers.sort()
# А может быть "переворнут":
ListNumbers.reverse()
# Можем вставить объект в необходимое нам место:
ListNumbers.insert(3, 4.45) 
# Можем объединить два списка:
ThirdList=ListNumbers+ListNumbersText
# Можем добавить данные из второго списка в первый:
ListNumbersText.extend(ListNumbers)
# Можем создать копию списка:
CopyListNumbers = ListNumbers.copy()
# Можем найти индекс интересующего нас числе
index = ListNumbers.index(6)
# можем посчитать сколько раз встречается то или иное число в списке
count1 = ThirdList.count(1.0)
'''
Важно понимать, что если мы просто присвоим переменной 
CopyListNumbers = ListNumbers, то мы создадим зависимую копию,
которая будет изменяться вместе со своим оригиналом.  
Можем полность почистить содержимое списка:
'''
ListNumbersText = []
# Можем узнать количество элементов в списке
Length = len(ListNumbers)
# Можем узнать сколько значений определенной виличины есть в списке
ListNumbersText.count(50000000)
# и т.д.

    
    




















