#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sun Feb 18 12:40:36 2024

@author: aas
"""

"""
Задача #1. 

Если мы возьмем все натуральные числа меньше 10, которые делятся на 3 и 5, то 
то получится следующее: 3, 5, 6 и 9. Их сумма равна 23.
Найти сумму натуральных чисел до 1000, которые делятся на 5 и 7.
"""

sum_integers = 0 # переменная куда мы будем накапливать сумму

integers = range(1, 1001) # числа [1, 2, ..., 10]
first_number = 5 # первый делитель
second_number = 7 # второй делитель

for number in integers: # проверяем каждое число в списке integers
    # проверяем делится ли число на 5 или 7 
  if number % first_number == 0 or number % second_number == 0:
      # если делится, то добавляем его к общей сумме
      sum_integers  += number
print ('----Task #1-------')
print ('Максимальное целое число ' + str(max(integers)))
print('Первый делитель ' + str(first_number))
print('Второй делитель ' + str(second_number))
print('Сумма всех чисел, которые делятся на ' 
      + str(first_number) + ' и на '  + str (second_number) 
      + ' = ' + str(sum_integers))
print('-----------------')
print(' ')



#%%
"""
Задача #10. 
Сумма простых чисел меньше 10: 2 + 3 + 5 +7 = 17.
Найдите сумму простых чисел меньше 1000.
"""

print ('----Task #2-------')
maximum_integer = 100 # максимальное натуральное числе
print ('Простые числа меньше ' + str(maximum_integer) + ':')

i=1 # переменная, которая в цикле будем меняться от 1 до 1000 с шагом 1
sum_=0 # переменная к которой мы будем прибавлять число i, если докажем, что
        # число i - простое число 

while i<maximum_integer: # цикл продолжается до тех пор, пока i меньше 1000
    i+=1 # шаг изменения переменной i
    count=1 # мнимая переменная. если = 1, значит числь простое, если нет, то
        # имеет делители отличные от 1 и самой себя
    for j in range(2,i): # цикл от 2 до числа i с шагом 1
        if i%j==0: # проверяем делится ли число i  на число j
            count=0 # если хоть один раз, услвовие i%j==0, значит число i
                    # не является простым и переменную count мы обнуляем и
                    # далее число i не будет добавлятся к переменной sum_
            break
    
    if count==1: # переменная count==1 если условие i%j==0 ни разу не было выполнено
                    # т.е. число i - простое
        sum_ += i
        print(i, end=' ')
        
print(' ')
print('Сумма этих чисел = '  + str(sum_))
print('-----------------')







