# -*- coding: utf-8 -*-

"""
Задача #1 (расширенная). 

Если мы возьмем все натуральные числа меньше 10, которые делятся на 3 и 5, то 
то получится следующее: 3, 5, 6 и 9. Их сумма равна 23.
Найти сумму натуральных чисел до 1000, которые делятся на 5 и 7
и записать эти числа в список.
"""

#sum_integers = 0 # переменная куда мы будем накапливать сумму

integers = list(range(1, 1001)) # числа [1, 2, ..., 1000]

first_number = 5 # первый делитель
second_number = 7 # второй делитель


list_with_numbers = [] #### 1 добавление к исходному решению

for number in integers: # проверяем каждое число в списке integers
    # проверяем делится ли число на 5 или 7 
  if number % first_number == 0 or number % second_number == 0:
      # если делится, то добавляем его к общей сумме
      #sum_integers  += number
      list_with_numbers.append(number) # 2 добавление

sum_integers = sum(list_with_numbers)

print ('----Task #1-------')
print ('Максимальное целое число ' + str(max(integers)))
print('Первый делитель ' + str(first_number))
print('Второй делитель ' + str(second_number))
print('Сумма всех чисел, которые делятся на ' 
      + str(first_number) + ' и на '  + str (second_number) 
      + ' = ' + str(sum_integers))
print('-----------------')
print(' ')



#%%





"""
файл names.txt содержит 500 тысяч имен.
Необходимо открыть файл и создать на его основе сиписок names, отсортированый
по алфавиту. 
Далее для каждого имени необходимо посчитать числовой рейтинг. 
Числовой рейтинг - сумма номеров каждой буквы имени в латинском алфавите. 
Т.е. буква A - номер 1, буква C - номер 3, буква Z - номер  26. 
Таким образом рейтинг имени COLIN будет 3+15+12+9+14 = 53.
После этого необходимо для каждого имени числовой рейтинг умножить на номер
имени в списке names, где номер начинается с 1, а не с 0, как обычно в Python.
Т.е. в случае COLIN имеем 53*(937+1) = 49714.
После этого нужно найти сумму всех произведений.

"""

# открываем файл names.txt (дожен распалагаться в текущей папке, иначе нужно)
# прописать путь до этого файла
with open ("../data/names.txt") as myfile:
    for names in myfile:
        names = names.replace('"', '') # удаляем все "
        names = names.split(",") # принимаем , в качастве разделителя
        names = sorted(names) # сортируем по алфавиту


# создаем словарь для присвоения каждому имени в списке рейтинга
# ключ к словарю - буква латинского алфавита
# значение - номер в латинском алфавите

letters = [] # список для записи ключей 
letter_number = [] # список для номера
for i in range(65, 91): # каждый символ в python имеет свой номер, с помощью которого
                        # с помощью которого символ можно вызывать ключевым словом chr()
                        # A-Z соотвтетсвуют номера от 65 до 91
    letters.append(chr(i))
    letter_number.append(len(letters))

alphabet = dict(zip(letters, letter_number)) # создаем словарь



sums_ = [] # в этот список будем записывать произведение рейтинга имени на его
            # номер в списке names

for i in range (len(names)):
    name = list(names[i]) # создаем список из букв имени
    sum_ = [] # создаем списсок, куда будем записывать номер буквы в алфавите
    for item in name:
        sum_.append(alphabet[item]) # в релультате получаем список с номерами
        
    sums_.append(sum(sum_)*(i+1)) # находим сумму этих номеров, умножаем на 
                                # на номер имени в списке names и добавляем
                                # результат в список sums_
   
# суммируем все элементы списка sums_ 
sum_of_all_names = sum(sums_)
